def trans_age(st):
    dic = {"01": "不詳",
           "02": "新生兒﹝未滿四週﹞",
           "03": "嬰兒(滿四週至未滿一歲)",
           "04": "1歲",
           "05": "2歲",
           "06": "3歲",
           "07": "4歲",
           "08": "5-9歲",
           "09": "10-14歲",
           "10": "15-19歲",
           "11": "20-24歲",
           "12": "25-29歲",
           "13": "30-34歲",
           "14": "35-39歲",
           "15": "40-44歲",
           "16": "45-49歲",
           "17": "50-54歲",
           "18": "55-59歲",
           "19": "60-64歲",
           "20": "65-69歲",
           "21": "70-74歲",
           "22": "75-79歲",
           "23": "80-84歲",
           "24": "85-89歲",
           "25": "90-94歲",
           "26": "95-99歲",
           "99": "100歲"
           }
    return dic[st]


def trans_cause(st):
    dic = {"01": "腸道傳染病",
           "02": "結核病",
           "03": "百日咳",
           "04": "腦膜炎感染症",
           "05": "破傷風",
           "06": "敗血症",
           "07": "天花",
           "08": "麻疹",
           "09": "瘧疾",
           "10": "惡性腫瘤",
           "11": "糖尿病",
           "12": "營養性消瘦",
           "13": "其他蛋白質卡路里不良",
           "14": "貧血",
           "15": "腦膜炎",
           "16": "心臟性疾病",
           "17": "高血壓性疾病",
           "18": "腦血管疾病",
           "19": "動脈粥樣硬化",
           "20": "肺炎",
           "21": "流行性感冒",
           "22": "支氣管炎、肺氣腫及氣喘",
           "23": "胃及十二指腸潰瘍",
           "24": "闌尾炎",
           "25": "慢性肝病及肝硬化",
           "26": "腎病變",
           "27": "攝護腺肥大",
           "28": "流產",
           "29": "直接生產死亡",
           "30": "先天性畸形",
           "31": "周產期之病態",
           "32": "事故傷害",
           "33": "自殺",
           "34": "他殺",
           "35": "其它"
           }
    return dic[st]


def trans_sex(st):
    dic = {"1": "男",
           "2": "女"
           }
    return dic[st]


x = 1


def getV():
    va = x
    return va


print(trans_sex('1'))

